app/Controllers/AttendanceController.php

SELECT *
FROM `classes`
---
    public function attendance()
    {
         $userId = session()->get('user_id');
        if (!$userId) {
            return redirect()->back()->with('error', 'User not logged in.');
        }

         $profilepicModel = new \App\Models\AdminStaffModel();
        $this->maybeMarkAbsentees();



        $studentModel = new \App\Models\StudentModel();
        $students = $studentModel->attendanceDetails();
          $profilepic = $profilepicModel->profileandfullnamestaff($userId);
        $class_model = new \App\Models\ClassModel();
        $data = [];
        $data['classes'] = $class_model->findAll();