app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'attendance'
 LIMIT 1
---
    public function loginPost()
    {
        $session = session();
        $figurdian = new GuardianModel();
        $userModel = new UserModel();
        $teacherModel = new \App\Models\Teacher_Model();
         $adminStaffModel  = new \App\Models\AdminStaffModel();
        $openingModel = new \App\Models\OpeningModel();
        $opening = $openingModel->orderBy('id', 'DESC')->first();
        if (!$opening) {
            return redirect()->to('admin-admission')->with('error', 'No active opening found.');
        }

        //set session properly
       $session->set(['opening_id' => $opening['id']]);

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        if (!$this->validate([
            'username' => 'required|min_length[1]|max_length[50]',
            'password' => 'required|min_length[3]'
        ])) {
            return redirect()->back()->withInput()->with('validation', \Config\Services::validation());
        }

        $user = $userModel->where('username', $username)->first();