app/Models/Admission_Model.php

SELECT *, `admission_id`, CONCAT(
                                UPPER(LEFT(last_name, 1)), LOWER(SUBSTRING(last_name, 2)), ', ', UPPER(LEFT(first_name, 1)), LOWER(SUBSTRING(first_name, 2)), ' ', UPPER(LEFT(middle_name, 1)), LOWER(SUBSTRING(middle_name, 2))
                            ) AS full_name, CONCAT('Laguna, ', ' ', `municipality`, ', ', `barangay`, ', ', street) AS address
FROM `admissions`
WHERE `admission_id` = '169'
 LIMIT 1
---
    public function getStudent($admissionId)
    {
        return $this->select("*,admission_id, CONCAT(
                                UPPER(LEFT(last_name,1)), LOWER(SUBSTRING(last_name,2)), ', ',
                                UPPER(LEFT(first_name,1)), LOWER(SUBSTRING(first_name,2)), ' ',
                                UPPER(LEFT(middle_name,1)), LOWER(SUBSTRING(middle_name,2))
                            ) AS full_name , CONCAT('Laguna ,' ,' ',municipality, ', ', barangay, ' , ', street) AS address")
                    ->where('admission_id', $admissionId)
                    ->first();

SELECT `a`.`user_id` AS `guardian_id`, `a`.`admission_id`, CONCAT(a.first_name, ' ', a.last_name) AS full_name, `s`.`profile_pic`
FROM `admissions` `a`
LEFT JOIN `guardiansaccount` `g` ON `g`.`user_id` = `a`.`user_id`
LEFT JOIN `students` `s` ON `s`.`user_id` = `a`.`admission_id`
WHERE `a`.`user_id` = '198'
AND `a`.`status` = 'Enrolled'
---
    public function getChildrenByGuardian($guardianId)
    {
        log_message('debug', 'Fetching children for guardian ID: ' . $guardianId);

        $builder = $this->db->table('admissions a');
        $builder->select("a.user_id AS guardian_id, a.admission_id, CONCAT(a.first_name, ' ', a.last_name) AS full_name, s.profile_pic");
        $builder->join('guardiansaccount g', 'g.user_id = a.user_id', 'left');
        $builder->join('students s', 's.user_id = a.admission_id', 'left');
        $builder->where('a.user_id', $guardianId);
         $builder->where('a.status', 'Enrolled');
        $query = $builder->get();