app/Models/AnnouncementModel.php

    public function activeAnnouncementstudent()
    {
        return $this->where([
            'status' => 'Active',

        ])->findAll();
---
SELECT *
FROM `announcement`
WHERE `status` = 'Active'