app/Models/GuardiansAccountModel.php

    public function getGuardiandata($userId)
    {
        return $this->select("guardiansAccount.*, users.*, CONCAT(guardiansAccount.first_name, ' ', guardiansAccount.last_name) AS full_name")
                    ->join('users', 'users.id = guardiansAccount.user_id')
                    ->where('guardiansAccount.user_id', $userId)
                    ->asObject()
                    ->first();
---
SELECT `guardiansAccount`.*, `users`.*, CONCAT(guardiansAccount.first_name, ' ', guardiansAccount.last_name) AS full_name
FROM `guardiansAccount`
JOIN `users` ON `users`.`id` = `guardiansAccount`.`user_id`
WHERE `guardiansAccount`.`user_id` = '198'
 LIMIT 1