app/Models/NotificationModel.php

    public function countAnnoucment($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('type', 'announcement')
                    ->where('is_read', 0)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '198'
AND `type` = 'announcement'
AND `is_read` = 0

    public function userNotif($userId)
    {
        return $this->where('user_id', $userId)
                    ->whereIn('type', ['payment', 'announcement', 'Admission','Update'])
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '198'
AND `type` IN ('payment','announcement','Admission','Update')
ORDER BY `created_at` DESC