app/Models/StudentModel.php

SELECT `s`.*, `ad`.`nickname`, `ad`.`middle_name`, `ad`.`nationality`, `ad`.`gender`, `ad`.`birthday` as `admission_birthday`, `ad`.`age`, `ad`.`father_name`, `ad`.`father_occupation`, `ad`.`mother_name`, `ad`.`mother_occupation`, `ad`.`contact_number`, `ad`.`email`, CONCAT(s.last_name, ' ', s.first_name) AS full_name, `at`.`date`, `at`.`arrival_time`, `at`.`leave_time`, `at`.`status`, `at`.`picked_up_by`, `at`.`id`
FROM `students` `s`
JOIN `admissions` `ad` ON `ad`.`admission_id` = `s`.`admission_id`
LEFT JOIN `attendance` `at` ON `at`.`user_id` = `s`.`user_id` AND `at`.`date` = CURDATE()
---
    public function attendanceDetails()
    {
        $builder = $this->db->table($this->table . ' s');
        $builder->select("
            s.*,
            ad.nickname,
            ad.middle_name,
            ad.nationality,
            ad.gender,
            ad.birthday as admission_birthday,
            ad.age,
            ad.father_name,
            ad.father_occupation,
            ad.mother_name,
            ad.mother_occupation,
            ad.contact_number,
            ad.email,
            CONCAT(s.last_name, ' ', s.first_name) AS full_name,
            at.date,
            at.arrival_time,
            at.leave_time,
            at.status,
            at.picked_up_by,
            at.id
        ");
        $builder->join('admissions ad', 'ad.admission_id = s.admission_id');
        $builder->join('attendance at', 'at.user_id = s.user_id AND at.date = CURDATE()', 'left');

        return $builder->get()->getResult();